Revit 2027 API
DuctSettings.FlatOnTop Property
 The abbreviation of the Flat On Top (FOT) string.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string FlatOnTop { get; set; }
Public Property FlatOnTop As String
	Get
	Set
public:
property String^ FlatOnTop {
	String^ get ();
	void set (String^ value);
}
member FlatOnTop : string with get, set
Property Value
String
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
DuctSettings Class
Autodesk.Revit.DB.Mechanical Namespace